# BtuPerLbDegreeF Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..BtuPerLbDegreeF Property
SymbolTypeId Class See Also
---
Symbol BTU/(lb·°F), indicating unit British thermal units per pound degree Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BtuPerLbDegreeF { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BtuPerLbDegreeF As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BtuPerLbDegreeF {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace